In [1]:
import pandas as pd

In [2]:
pd.Series([100, 50, 150])

0    100
1     50
2    150
dtype: int64

In [4]:
pd.Series([100, 500, 150], index=['카카오', '삼성전자', '현대차'])

카카오     100
삼성전자    500
현대차     150
dtype: int64

In [5]:
series_ex1 = pd.Series([100, 500, 150], index=['카카오', '삼성전자', '현대차'])
print(series_ex1['카카오'])
print(series_ex1['현대차'])

100
150

In [6]:
print(series_ex1[1])

500

In [23]:
pd.DataFrame({'가격':[100, 500, 150], 'PER':[0.5, 1.2, 0.2], 'ROA':[1.01, 3.1, 0.97]}, index=['카카오', '삼성전자', '현대차'])

       가격  PER   ROA
카카오   100  0.5  1.01
삼성전자  500  1.2  3.10
현대차   150  0.2  0.97

In [24]:
df_ex1 = pd.DataFrame({'가격':[100, 500, 150], 'PER':[0.5, 1.2, 0.2], 'ROA':[1.01, 3.1, 0.97]}, index=['카카오', '삼성전자', '현대차'])
df_ex1['가격']

카카오     100
삼성전자    500
현대차     150
Name: 가격, dtype: int64

In [25]:
df_ex1.loc['카카오']

가격     100.00
PER      0.50
ROA      1.01
Name: 카카오, dtype: float64

In [26]:
df_ex2 = pd.DataFrame({'가격':[100, 140, 155, 70, 90], 
                       'PER':[1.1, 0.8, 0.7, 2.3, 3.9],
                       '거래량':[1000, 800, 890, 700, 2000]},
                     index=['a', 'b', 'c','d', 'e'])

In [27]:
df_ex2

    가격  PER   거래량
a  100  1.1  1000
b  140  0.8   800
c  155  0.7   890
d   70  2.3   700
e   90  3.9  2000

In [29]:
df_ex2[df_ex2['가격'] >=100]

    가격  PER   거래량
a  100  1.1  1000
b  140  0.8   800
c  155  0.7   890

In [30]:
df_ex2[df_ex2['거래량'] < 1000]

    가격  PER  거래량
b  140  0.8  800
c  155  0.7  890
d   70  2.3  700

In [31]:
df_ex2['PER'].sort_values()

c    0.7
b    0.8
a    1.1
d    2.3
e    3.9
Name: PER, dtype: float64

In [32]:
df_ex2['PER'].sort_values(ascending=False)

e    3.9
d    2.3
a    1.1
b    0.8
c    0.7
Name: PER, dtype: float64

In [37]:
df_ex2.sort_values(by='PER', ascending=False)

    가격  PER   거래량
e   90  3.9  2000
d   70  2.3   700
a  100  1.1  1000
b  140  0.8   800
c  155  0.7   890

In [38]:
df_ex2['거래량'].rank()

a    4.0
b    2.0
c    3.0
d    1.0
e    5.0
Name: 거래량, dtype: float64

In [39]:
df_ex2['거래량'].rank(ascending=False)

a    2.0
b    4.0
c    3.0
d    5.0
e    1.0
Name: 거래량, dtype: float64

In [41]:
file_path = 'C:\\Users\\gjals\Desktop\\코딩\\파이썬으로 퀀트투자 만들기\\per.xlsx'
pd.read_excel(file_path, sheet_name='per')

             회사명     per
0           삼성전자   15.23
1         SK하이닉스   22.86
2           셀트리온  103.09
3           LG화학  103.67
4            현대차   17.23
...          ...     ...
2210        엠투아이   42.00
2211      이리츠코크렙   25.29
2212     영림원소프트랩   58.82
2213        신도기연   50.83
2214  IBKS제14호스팩    0.00

[2215 rows x 2 columns]

In [44]:
per_data = pd.read_excel(file_path, sheet_name='per', index_col=0)

In [45]:
per_data

               per
회사명
삼성전자         15.23
SK하이닉스       22.86
셀트리온        103.09
LG화학        103.67
현대차          17.23
...            ...
엠투아이         42.00
이리츠코크렙       25.29
영림원소프트랩      58.82
신도기연         50.83
IBKS제14호스팩    0.00

[2215 rows x 1 columns]

In [50]:
filtered_per = per_data[per_data['per'] > 0]

In [51]:
sorted_per = filtered_per.sort_values(by='per')

In [52]:
sorted_per

              per
회사명
KG ETS       1.15
양지사          1.22
이엠앤아이        1.24
지와이커머스       1.28
오가닉티코스메틱     1.40
...           ...
안국약품      1024.00
로고스바이오    1129.00
와이팜       1770.33
유티아이      2047.00
신풍제약      2743.44

[1291 rows x 1 columns]

In [53]:
sorted_per['per랭킹'] = sorted_per['per'].rank()

In [55]:
sorted_per

              per   per랭킹
회사명
KG ETS       1.15     1.0
양지사          1.22     2.0
이엠앤아이        1.24     3.0
지와이커머스       1.28     4.0
오가닉티코스메틱     1.40     5.0
...           ...     ...
안국약품      1024.00  1287.0
로고스바이오    1129.00  1288.0
와이팜       1770.33  1289.0
유티아이      2047.00  1290.0
신풍제약      2743.44  1291.0

[1291 rows x 2 columns]

In [56]:
roa_data = pd.read_excel(file_path, sheet_name='roa', index_col=0)

In [57]:
filtered_roa = roa_data.dropna()

In [58]:
filtered_roa

            과거 ROA (%)
회사명
삼성전자              6.21
SK하이닉스            3.41
셀트리온              9.96
LG화학              1.24
현대차               1.00
...                ...
엠투아이              6.14
이리츠코크렙            1.85
영림원소프트랩           5.30
신도기연              5.15
IBKS제14호스팩        0.00

[2215 rows x 1 columns]

In [59]:
filtered_roa.columns = ['roa']

In [73]:
filtered_roa

             roa
회사명
삼성전자        6.21
SK하이닉스      3.41
셀트리온        9.96
LG화학        1.24
현대차         1.00
...          ...
엠투아이        6.14
이리츠코크렙      1.85
영림원소프트랩     5.30
신도기연        5.15
IBKS제14호스팩  0.00

[2215 rows x 1 columns]

In [74]:
sorted_roa = filtered_roa.sort_values(by='roa', ascending=False)

sorted_roa['roa랭킹'] = sorted_roa.rank(ascending=False)

In [80]:
total_df = pd.merge(sorted_per, sorted_roa, how='inner', left_index=True, right_index=True)

In [81]:
total_df

              per   per랭킹     roa   roa랭킹
회사명
KG ETS       1.15     1.0   28.52    13.0
양지사          1.22     2.0   51.24     5.0
이엠앤아이        1.24     3.0  292.86     1.0
지와이커머스       1.28     4.0  133.52     2.0
오가닉티코스메틱     1.40     5.0    9.08   215.0
...           ...     ...     ...     ...
안국약품      1024.00  1287.0    0.09  1289.0
로고스바이오    1129.00  1288.0    0.40  1224.0
와이팜       1770.33  1289.0    0.53  1190.5
유티아이      2047.00  1290.0    0.12  1284.0
신풍제약      2743.44  1291.0    0.46  1208.0

[1291 rows x 4 columns]

In [89]:
total_df['종합랭크'] = (total_df['per랭킹'] + total_df['roa랭킹']).rank()
total_df.sort_values(by='종합랭크')

              per   per랭킹     roa   roa랭킹    종합랭크
회사명
이엠앤아이        1.24     3.0  292.86     1.0     1.0
지와이커머스       1.28     4.0  133.52     2.0     2.0
양지사          1.22     2.0   51.24     5.0     3.0
미래아이앤지       1.43     6.0   39.36     6.0     4.0
KG ETS       1.15     1.0   28.52    13.0     5.0
...           ...     ...     ...     ...     ...
알에스오토메이션   656.00  1280.0    0.14  1280.5  1287.0
이아이디       572.50  1277.0    0.10  1287.0  1288.0
코아시아       831.33  1282.0    0.09  1289.0  1289.0
유티아이      2047.00  1290.0    0.12  1284.0  1290.0
안국약품      1024.00  1287.0    0.09  1289.0  1291.0

[1291 rows x 5 columns]